[{"data":1,"prerenderedAt":400},["Reactive",2],{"CrFlcjRAY8":3,"search-api":239},{"data":4,"body":10,"excerpt":-1,"toc":226},{"title":5,"description":6,"model":7,"image":8,"aside":9},"Fraude à la facture","Ikéa, Décathlon, Edf... Vos factures sont falsifiable à loisir","brouillon_atelier","https://media.paxpar.tech/1019-document-signature-hand_small.svg",false,{"type":11,"children":12},"root",[13,21,28,34,49,55,61,66,71,76,83,87,93,98,102,108,112,116,120,127,131,137,141,145,149,153,162,166,170,174,181,185,192,196,201,205,211,216,221],{"type":14,"tag":15,"props":16,"children":18},"element","h1",{"id":17},"ikéa-décathlon-edf-vos-factures-sont-falsifiable-à-loisir",[19],{"type":20,"value":6},"text",{"type":14,"tag":22,"props":23,"children":25},"h2",{"id":24},"pitch-scénario",[26],{"type":20,"value":27},"Pitch - Scénario",{"type":14,"tag":29,"props":30,"children":33},"ppw-chat-conversation",{":conversation":31,":animate":32},"[{\"valerie\":\"En tant que particulier ou entreprise... Nous recevons de plus en plus de documents dans un format dématérialisé via notre boite e-mail personnelle, pro, et également d’un service à un autre au sein d’une même entreprise\"},{\"valerie\":\"- Peut-on avoir confiance en ces documents ?\"},{\"valerie\":\"- Recevoir ces documents dématérialisés est-il un gage de fiabilité comparativement à un document en version papier ?\"},{\"valerie\":\"Nous allons voir 3 cas concrets de factures.\"},{\"valerie\":\"- Puis-je avoir confiance en 2 de ces factures et les régler en toute confiance ?\"},{\"valerie\":\"- Puis-je accepter, sans me méfier, une facture EDF comme justificatif de domicile ?\"},{\"valerie\":\"Voyons tout d’abord ensemble quels sont les risques auxquels je m’expose.\"}]","true",[],{"type":14,"tag":35,"props":36,"children":38},"alert",{"type":37},"info",[39],{"type":14,"tag":40,"props":41,"children":42},"ul",{},[43],{"type":14,"tag":44,"props":45,"children":46},"li",{},[47],{"type":20,"value":48},"TODO: viewer du slide risque",{"type":14,"tag":22,"props":50,"children":52},{"id":51},"acteurs",[53],{"type":20,"value":54},"Acteurs",{"type":14,"tag":56,"props":57,"children":58},"p",{},[59],{"type":20,"value":60},"Nadine",{"type":14,"tag":56,"props":62,"children":63},{},[64],{"type":20,"value":65},"Alice",{"type":14,"tag":56,"props":67,"children":68},{},[69],{"type":20,"value":70},"Jean",{"type":14,"tag":56,"props":72,"children":73},{},[74],{"type":20,"value":75},"Isabelle",{"type":14,"tag":77,"props":78,"children":80},"h3",{"id":79},"introduction-du-premier-cas",[81],{"type":20,"value":82},"Introduction du premier cas",{"type":14,"tag":29,"props":84,"children":86},{":conversation":85,":animate":32},"[{\"nadine\":\"Je fais appel à une décoratrice d’intérieur :ppw-chat-actor{name=\\\"alice\\\" showname} pour du Home Staging.\"},{\"nadine\":\"Sa prestation terminée, elle me présente une facture Ikéa pour le remboursement de quelques articles dont elle a eu besoin pour agrémenter mon salon.\"}]",[],{"type":14,"tag":22,"props":88,"children":90},{"id":89},"mise-en-scène",[91],{"type":20,"value":92},"Mise en scène",{"type":14,"tag":94,"props":95,"children":97},"ppw-pdf-link",{"href":96},"/documents/ikea_f.pdf",[],{"type":14,"tag":29,"props":99,"children":101},{":conversation":100,":animate":32},"[{\"nadine\":\"J'ouvre le pdf facture\"},{\"nadine\":\"Je le vérifie visuellement, ok ça me semble correct, la date des achats est cohérente avec la mission, les articles listés sont bien chez moi dans mon nouvel intérieur cosy. Je vais lui régler la facture à Alice.\"},{\"alice\":\"Et pourtant, Nadine n'aurait pas dû régler, cette facture a été modifiée et elle ne peut pas s'en rendre compte sans une plateforme spécialisée.\"},{\"alice\":\"Et c'est très facile à faire\"},{\"alice\":\"Voici comment je m'y suis prise pour modifier la facture\"},{\"alice\":\"J'enregistre une copie du pdf original en modifiant le nom « _originale »\"},{\"alice\":\"Je fais les modifications suivantes -- montants HT, TTC et Total et j'enregistre la nouvelle facture au format PDf en gardant le nom de l'original.\"},{\"alice\":\"Et voilà, le tour est joué. Visuellement la cliente ne peut pas s'en rendre compte avec une facture version pdf simple, si cela avait été une version papier cela aurait été la même chose, elle ne peut pas savoir, juste en se basant sur le visuel du pdf, si elle est authentique ou non. Et la facture a été réglée.\"}]",[],{"type":14,"tag":77,"props":103,"children":105},{"id":104},"introduction-du-deuxième-cas",[106],{"type":20,"value":107},"Introduction du deuxième cas",{"type":14,"tag":29,"props":109,"children":111},{":conversation":110,":animate":32},"[{\"nadine\":\"Je commence une nouvelle activité de location de vélos électriques. La flotte est d’occasion pour le moment, mais je ne veux pas de souci lié à des défauts de batterie. Je confie à mon commercial Jean, la mission d’acheter des batteries neuves 10 de 36v, 10 de 24v et 4 chargeurs pour chacun des modèles de batterie.\"},{\"nadine\":\"J'ai également demandé à Jean de faire le tour de la flotte, il a constaté quelques éléments à remplacer ou manquants, il s’est donc rendu en magasin pour acheter les batteries et chargeurs que je lui ai demandé ainsi que quelques accessoires. Il me transmet la facture par mail pour la comptabilité.\"}]",[],{"type":14,"tag":94,"props":113,"children":115},{"href":114},"/documents/deca_FA130000190890-f.pdf",[],{"type":14,"tag":29,"props":117,"children":119},{":conversation":118,":animate":32},"[{\"nadine\":\"Je la vérifie visuellement, ok ça semble correct, la date des achats est cohérente avec la mission, les articles listés sont bien à l’atelier. Je peut régler la facture.\"},{\"jeanL\":\"Lorsque ma patronne reçoit une facture papier, ou même une version pdf simple, elle ne peut pas savoir, juste en se basant sur le visuel du pdf, si elle est authentique ou non (à moins de vérifier les caractéristiques de chaque article sur le site ou en magasin !) Cela lui demanderait beaucoup de temps. Du coup, a t'elle raison de se fier uniquement sur le visuel ? Et non, comme Alice, j'ai modifié la facture et voilà comment j'ai fait.\"}]",[],{"type":14,"tag":121,"props":122,"children":124},"h4",{"id":123},"modification-du-pdf",[125],{"type":20,"value":126},"Modification du pdf",{"type":14,"tag":29,"props":128,"children":130},{":conversation":129,":animate":32},"[{\"jeanL\":\"J'enregistre une copie du pdf original en modifiant le nom « _originale »\"},{\"jeanL\":\"Je modifie les quantités mais je ne change pas le montant total\"},{\"jeanL\":\"J'enregistre la nouvelle facture au format PDF en gardant le nom de l'original. C'est simple\"},{\"jeanL\":\"Voilà comment j'ai arnaqué ma patronne. Je pourrais récupérer les articles supplémentaires et les revendre moi-même.\"}]",[],{"type":14,"tag":77,"props":132,"children":134},{"id":133},"introduction-du-troisième-cas",[135],{"type":20,"value":136},"Introduction du troisième cas",{"type":14,"tag":29,"props":138,"children":140},{":conversation":139,":animate":32},"[{\"nadine\":\"Isabelle veux souscrire un prêt à la consommation auprès de Sofinco mais ne veut pas régler les échéances, pour cela l'organisme va lui demander un justificatif de domicile. Elle va fournir une facture EDF par mail dont elle aura falsifiée le nom. Est-ce que l'organisme de prêt peut avoir confiance en cette facture et peut-il se rendre compte que le justificatif est falsifié ?\"}]",[],{"type":14,"tag":29,"props":142,"children":144},{":conversation":143,":animate":32},"[{\"isabelle\":\"Je vais vous démontrer que non\"},{\"isabelle\":\"Je vais la modifier en changeant le nom du destinataire\"},{\"isabelle\":\"J'enregistre une copie du pdf original en modifiant le nom « _originale »\"},{\"isabelle\":\"Je modifie le nom sous inkscape\"},{\"isabelle\":\"J'enregistre la nouvelle facture au format pdf en gardant le nom de l’original.\"},{\"isabelle\":\"Vérifier un pdf visuellement, même s'il est noté « document électronique certifié authentique », ok ça semble plutôt pas mal. MAIS, est-ce un argument suffisant pour faire confiance à cette facture ?\"}]",[],{"type":14,"tag":94,"props":146,"children":148},{"href":147},"/documents/pu_edfb.pdf",[],{"type":14,"tag":29,"props":150,"children":152},{":conversation":151,":animate":32},"[{\"isabelle\":\"Je dépose la facture authentique dans adobe qui indique bien que la signature ELECTRICITE DE FRANCE est valable\"}]",[],{"type":14,"tag":56,"props":154,"children":155},{},[156],{"type":14,"tag":157,"props":158,"children":161},"img",{"alt":159,"src":160},"","/images/images_putaclic/edf_phec_adobe.png",[],{"type":14,"tag":29,"props":163,"children":165},{":conversation":164,":animate":32},"[{\"isabelle\":\"Maintenant, au tour de la facture falsifiée\"}]",[],{"type":14,"tag":94,"props":167,"children":169},{"href":168},"/documents/pu_edfc.pdf",[],{"type":14,"tag":29,"props":171,"children":173},{":conversation":172,":animate":32},"[{\"isabelle\":\"Comme le document n'est pas signé, adobe n'indique pas l'onglet vérification de signature\"}]",[],{"type":14,"tag":56,"props":175,"children":176},{},[177],{"type":14,"tag":157,"props":178,"children":180},{"alt":159,"src":179},"/images/images_putaclic/edf_isa_adobe.png",[],{"type":14,"tag":29,"props":182,"children":184},{":conversation":183,":animate":32},"[{\"isabelle\":\"Je signe le document avec un PSC sous le nom ELECTRICITE DE FRANCE et le dépose de nouveau dans adobe\"}]",[],{"type":14,"tag":56,"props":186,"children":187},{},[188],{"type":14,"tag":157,"props":189,"children":191},{"alt":159,"src":190},"/images/images_putaclic/edf_un_adobe.png",[],{"type":14,"tag":29,"props":193,"children":195},{":conversation":194,":animate":32},"[{\"isabelle\":\"Adobe indique que la signature est bien ELECTRICITE DE FRANCE et est valable, pourtant ce n'est pas le cas.\"},{\"isabelle\":\"Comment faire pour distinguer la vraie de la fausse ????\"},{\"isabelle\":\"Il faut une règle métier qui permette d’identifier que le signataire est bien la société qui s’affiche comme signataire\"},{\"isabelle\":\"La plateforme VérifTonDoc est capable de vérifier ces conformités métier\"},{\"isabelle\":\"Reprenons l'exemple de nos 2 factures EDF\"},{\"isabelle\":\"Avec VérifTonDoc, il suffit de déposer les pdfs dans la dropzone et la checklist nous indique si le document est conforme ou pas\"}]",[],{"type":14,"tag":197,"props":198,"children":200},"ppw-showcase-check",{":pdfs":199},"[{\"url\":\"/documents/edf_20230524b.pdf\",\"check_result\":\"/blog/2023/10/_cl_edf_20230524b.yaml\",\"name\":\"Facture EDF\",\"conversation\":[{\"isabelle\":\"1er pdf, la checklist indique que tout est Ok\"}]},{\"url\":\"/documents/edf_20230524c.pdf\",\"check_result\":\"/blog/2023/10/_cl_edf_20230524c.yaml\",\"name\":\"Facture EDF\",\"conversation\":[{\"isabelle\":\"2ème pdf, la checklist indique que la signature dans la conformité métier est KO, la clé publique de ELECTRICITE DE FRANCE n'a pas été trouvée\"},{\"isabelle\":\"C'est donc la 2ème facture qui a été falsifiée\"}]}]",[],{"type":14,"tag":29,"props":202,"children":204},{":conversation":203},"[{\"nadine\":\"Le but de cet atelier était de montrer que quelqu’un qui reçoit une facture papier, ou même une version pdf simple ne peut pas savoir, juste en se basant sur le visuel du pdf, si elle est authentique ou non. Pour un document signé électroniquement, même avec la mention « document électronique certifié authentique » inscrite sur le document, il faut utiliser un outil qui puisse vérifier des conformités métier et s'assurer que la signature apposée est bien celle du signataire attendu.\"}]",[],{"type":14,"tag":22,"props":206,"children":208},{"id":207},"questions",[209],{"type":20,"value":210},"Questions",{"type":14,"tag":56,"props":212,"children":213},{},[214],{"type":20,"value":215},"Vous avez parlé d'une clé publique dans le dernier cas. Pouvez-vous nous expliquer ?\n- La clé publique est un message chiffré, si cette clé est nominative, VérifTonDoc est capable de vérifier si la clé est bien celle du signataire qu'on attend.",{"type":14,"tag":56,"props":217,"children":218},{},[219],{"type":20,"value":220},"Vous avez dit qu'on ne peut pas faire de vérification avec un pdf simple. Quel pdf faut-il pour pouvoir en faire ? et comment peut-on l'obtenir ?\n- Il faut un pdf que l'on dit enrichi, c'est à dire dans lequel on a mis des métadonnées (données non visibles mais qui peuvent être analysées par la plateforme VérifTonDoc). Nous pourrons montrer lors d'un prochain atelier comment enrichir un pdf, quel qu'il soit. VérifTonDoc peut générer ce genre de pdf.",{"type":14,"tag":56,"props":222,"children":223},{},[224],{"type":20,"value":225},"VérifTonDoc dans votre exemple a vérifier la signature, est-ce que la plateforme peut vérifier autre chose ?\n- Oui bien sûr, VérifTonDoc n'est pas seulement une plateforme de vérfication de signature, elle peut vérifier des documents comme des PAFs, des factures, des contrats...etc. Il faut simplement établir la liste des critères que vous voulez vérifier, cela peut être des calculs, des dates, le nombre de document...cela est en fonction du domaine dans lequel on est. C'est le client qui détermine ses propres critères à vérifier.",{"title":159,"searchDepth":227,"depth":227,"links":228},2,[229,230,234,238],{"id":24,"depth":227,"text":27},{"id":51,"depth":227,"text":54,"children":231},[232],{"id":79,"depth":233,"text":82},3,{"id":89,"depth":227,"text":92,"children":235},[236,237],{"id":104,"depth":233,"text":107},{"id":133,"depth":233,"text":136},{"id":207,"depth":227,"text":210},[240,246,254,263,273,279,287,294,301,309,316,323,330,337,345,352,359,373,380,386,393],{"id":241,"path":242,"dir":159,"title":243,"description":159,"keywords":244,"body":245},"content:0.index.md","/","Home",[],"     Our vision of Docus present and future.   Our experiments with   Docus  to fit our needs\nin a very opinionated way.      Target scenario   S3 content backend   JSON-schema support  PDF file support  Exotic file type support  Custom nuxt layer   Nuxt Studio feedback   Nuxt UI pro migration  ",{"id":247,"path":248,"dir":249,"title":250,"description":159,"keywords":251,"body":253},"content:1.introduction:1.getting-started.md","/introduction/getting-started","introduction","Getting Started",[252],"TODO","  Getting Started  TODO   exotic format : PDF  exotic format : FEC, ifc, XML, ...  k8s deployment  vue/nuxt/content/docus/studio  painfull JS/TS stack (yarn/pnpm/bun)  static/SSR/hybrid/SPA/... mess, hard to understand",{"id":255,"path":256,"dir":159,"title":257,"description":159,"keywords":258,"body":262},"content:10.scenario:index.md","/scenario","Scenario",[259,260,261],"content authoring","webcomponent use","portal fork","  Scenario  content authoring  We need to write a lot of content.\nDocumentation but also knowledge articles.\n  Here is a sample rich content article  as it is written by non-developpers.  We use our components a lot in those articles thanks to MDC :   ::ppw-showcase-check\n---  \npdfs:\n- url: \"🌐pp/api/bucket/public/blog/2023_10_atelier/pu_edfb.pdf\"\n  check_result: \"🌐pp/api/bucket/public/blog/2023_10_atelier/cl_edf_20230524b.yaml\"\n  name: \"Facture EDF b\"\n  conversation:\n    - isabelle: \"1er pdf, la checklist indique que tout est Ok\"\n- url: \"🌐pp/api/bucket/public/blog/2023_10_atelier/pu_edfc.pdf\"\n  check_result: \"🌐pp/api/bucket/public/blog/2023_10_atelier/cl_edf_20230524c.yaml\"\n  name: \"Facture EDF c\"\n  conversation:\n    - isabelle: \"2ème pdf, la checklist décéle une anomalie/non-conformité métier. Si vous cliquez sur le blason, vous découvrirez qu'il s'agit d'une erreur sur sur la clé publique de signature d'ELECTRICITE DE FRANCE, celle-ci n'a pas été trouvée.\" \n    - isabelle: \"C'est donc la 2ème facture qui a été falsifiée\"                    \n---\n:: \n  A good visual editor is a must.\nParticulary when it comes to show helpfull error/warning messages to the author.   Here is a broken example  where the page is not showing up\nand no clear error message is given.  webcomponent use  TODO: describe here a scenario\nwhere we use some of our widgets as webcomponent in a simple HTML page.  portal fork  TODO: describe here a scenario\nwhere a user can fork our template project and inherit all the base features.  steps :   go to the github repo xxx  fork it  wait for the initial deployment  go to the site  click on the nuxt studio link on the github README  edit basic content  create a new doc schema  create document from the previous doc type with the text editor  create document from the previous doc type with the visual editor",{"id":264,"path":265,"dir":266,"title":267,"description":159,"keywords":268,"body":272},"content:10.scenario:sample_parcours.md","/scenario/sample_parcours","scenario","Sample broken",[269,270,271],"Bienvenue sur VerifTonDoc Express !","👉 Interessé, devenez contributeur","🤔💭 Quelques hésitations","  Sample broken   Bienvenue sur VerifTonDoc Express !  Vous cherchez une solution pour vérifier vos documents en un seul clic, décelant pour vous les anomalies et garantissant la conformité des informations, alors   vous êtes au bon endroit .  Explorons ensemble, une approche novatrice dans la vérification documentaire, où la facilité s'allie à l'efficacité. Nous vous proposons de parcourir un trajet intuitif qui simplifie chaque étape, garantissant des documents vérifiés avec aisance et rapidité.  Vous êtes en possesion de votre document pdf, c'est parfait. Vous avez juste à vous rendre sur la pleteforme paxpar en cliquant   ici . Puis, faîtes glisser votre document, sur la dropzone.  Si vous n'avez pas de documents PDFs à portée de main, pas de problème, télécharger ce document PDF de démonstration.  (pdf_link)  C'est gagné !!!\nVous pouvez savoir si votre document est conforme.   👉 Interessé, devenez contributeur  Si vous êtes enthousiaste et inspiré par ces exemples et que vous souhaitez expérimenter avec vos propres documents, veuillez compléter ce formulaire. En retour, vous bénéficierez de   2 heures de sessions gratuites  avec nos experts pour configurer notre plateforme.   Formulaire d'enregistrement \n1. Désposez les documents suivants\n     un document signé par vos soins (nom et adresse de la personne)    un document que vous souhaitez analyser   Quel est votre nom et votre prénom ? (Réponse courte)\n  Réponse ici  Quel est votre numéro de téléphone ? (Réponse courte)   Réponse ici  Je m'identifie par     email    SMS    google    github    gitlab  Avez-vous des remarques ?\n  Réponse ici  Je valide     le partage de mes documents avec l'équipe support    les   CGVs  de paxpar     Je m'enregistre pour contribuer  Je m'enregistre pour créer mon portail  🤔💭 Quelques hésitations  Vous avez encore quelques hésitations, alors prenons un exemple tout simple : vous venez de recevoir une   facture EDF  par mail, tout vous semble correct.  Mais par acquis de conscience, vous préférez le vérifier;  En cliquant sur le fichier, il est alors sélectionné et la liste de contrôle s'affiche en précisant votre conformité. Vous avez la possibilité d'afficher le contenu du dossier, en cliquant sur l'oeil, en haut à droite.   Ces points de contrôle sont flexibles et sont élaborés en collaboration avec un expert du domaine, tel qu'un commissaire aux comptes ou un expert comptable.  Si vous êtes un expert intéressé par l'application de cette approche à votre problème, devenir contributeur de Paxpar est simple : il vous suffit de remplir le formulaire d'enregistrement, ci-dessus.  👉 A l'issue de ces   2 sessions d'une heure gratuites , vous recevrez   votre premier article , comprenant des éléments interactifs, des astuces de création, et une liste de vérification (présentés en format Markdown). Lors de la session, nous vous montrerons cet article en partage d'écran.  visualiser l'article  Cependant, si vous souhaitez rédiger ou consulter des contenus sur votre propre site web, nous vous recommandons de passer au   WebTonDoc .    🧐 Vous voulez en savoir plus ?       Signataire habilité  à signer ce document   Chaque signataire équipé d'une signature électronique est associé à une clé publique. Cette clé publique est exploitée pour assurer votre assurance que la personne qui signe correspond bien à celle attendue.     Checklist  à l'effigie de votre société   Vous voulez rassurer vos clients, en vérifiant des documents sensibles tels que des contrats, des factures, ... alors vous pouvez créer votre propre checklist.    Vérification croisée   (xls, png, pdf)   Votre dossier renferme des données de différentes sources : des tableaux d'analyse   au format excel , des photos   au format png , des rapports   au format pdf  et vous souhaitez croiser ces données, et ainsi vérifier leur cohérence.    Accès aux   non-conformités  en un click   En soumettant votre dossier, vous recevez immédiatement son degré de conformité, évalué directement par vos propres experts, sur la base d'une liste de vérification pré-établie.     Vérification  d'un dossier digital   Gérez, structurez, vérfiez et organisez des dossiers digitaux vous prend du temps, vous êtes désireux de gagner du temps sur ces tâches chronophages. Alors commencez par créer votre premier   dossier digital , puis tester-le, en le déposant simplement dans la drop-zone prévue à cet effet.     Ajout  d'un point de contrôle   Afin de rester en accord avec les changements réglementaires, vous avez la possibilité d'incorporer ces évolutions directement dans vos listes de vérification. Notre équipe de support est disponible pour vous guider dans cette démarche de conformité.    Elaboration d'un   rapport de vérification   Si vous avez des préoccupations quant à la bonne orientation de votre dossier et souhaitez témoigner de votre engagement, vous avez la possibilité de créer un rapport de vérification répertoriant toutes vos demandes, chacune datée, pour démontrer votre transparence.    Essai   Gratuit/Démonstration   Nous vous proposons de tester notre plateforme, en bénéficiant de   2h de sessions gratuites  avec nos experts, 3 communiqués sur LinkedIn en co-rédaction et 6 mois d'  abonnement gratuit .",{"id":274,"path":275,"dir":266,"title":276,"description":159,"keywords":277,"body":278},"content:10.scenario:sample_rich_content.md","/scenario/sample_rich_content","Sample rich content",[],"  Sample rich content      ",{"id":280,"path":281,"dir":282,"title":283,"description":284,"keywords":285,"body":286},"content:20.docus:bun.md","/docus/bun","docus","bun","Describe here the workflow with bun packet manager.",[],"  bun  Describe here the workflow with bun packet manager.  TODO: describe how to dev locally with the layer",{"id":288,"path":289,"dir":282,"title":290,"description":291,"keywords":292,"body":293},"content:20.docus:filter_ignore.md","/docus/filter_ignore","Filter / Ignore","YAML and JSON files are first class content payloads.",[],"  Filter / Ignore  YAML and JSON files are first class content payloads.  But YAML and JSON files can also be   opaque  assets not related to content.\nWe may think this is not a trouble to let those files be consumed as content payloads.\nBut in some cases they may be big and will probably clutter the content engine.  We would like to define which YAML/JSON should be ignored by the content engine.  We would also like to define a filter for intermediate cases where we want to keep a small part of the JSON/YAML payload as content.",{"id":295,"path":296,"dir":282,"title":297,"description":298,"keywords":299,"body":300},"content:20.docus:gitlab.md","/docus/gitlab","gitlab","Objective: Being able to deploy a docus instance on gitlab pages\nfrom a private repo and editing the whole thing trough nuxt studio.",[],"  gitlab  Objective: Being able to deploy a docus instance on gitlab pages\nfrom a private repo and editing the whole thing trough nuxt studio.  Why:   have a public site while keeping the repo private  don't rely on nuxt studio for deployment (see 2023-11-03 cloudflare outage)  Inspired from   gitlab nuxt example .  steps :    npx nuxi@latest init pp-front -t themes/docus  create   .gitlab-ci.yml  git commit/push to a private github repo  create github secret GITLAB_ACCESS_TOKEN  create personal access token or a fine-grained personal access token  create a synched gitlab repo, option   Run CI/CD for external repository  git commit/push to the private gitlab repo  static site should be deployed and running  mirror gitlab \u003C-> github",{"id":302,"path":303,"dir":282,"title":304,"description":305,"keywords":306,"body":308},"content:20.docus:json_schema.md","/docus/json_schema","JSON schema","See also JSON-schema (related to Nuxt studio):",[307],"$schema transform","  JSON schema  See also JSON-schema (  related to Nuxt studio ):  $schema transform  When defining a   new content transformer \nwe tell which extensions are involved.  It's fine to target single purpose file formats like '.xlsx' or '.csv'.\nBut it's not enough to set up a transformer for a special YAML or JSON based dialect.  We can use custom extension like   .checklist.yaml  but it would be better to detect the thoses files without modifiyng them.  For JSON/YAML special dialects it is very common to use the   $schema property .   $schema  filter  Expected new YAML/JSON schema transformer :     export   default   defineJSONSchemaTransformer  ({\n     name:   'my-dummy-transformer'  ,\n     schema:   '$schema: https://paxpar.tech/schema/mycheck/default/0'  ,\n     extensions: [\n       '.yaml'  ,\n       '.yml'  ,\n       '.json'  ,\n     ],\n     // ...\n   })\n  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",{"id":310,"path":311,"dir":282,"title":312,"description":313,"keywords":314,"body":315},"content:20.docus:layer.md","/docus/layer","custom layer","TODO:",[],"  custom layer  TODO:   add pp-widgets as a private layer  describe the pitfalls  add a public layer with working code",{"id":317,"path":318,"dir":282,"title":319,"description":320,"keywords":321,"body":322},"content:20.docus:s3.md","/docus/s3","S3 bucket","See also S3 bucket for nuxt studio.",[],"  S3 bucket  See also   S3 bucket for nuxt studio .  TODO:   Explore\nthe   nuxt sources configuration \nwhich is based on   unjs/unstorage \nwhich support S3 backend.  Use a S3 bucket as a nuxt content storage  Merge/mix nuxt content storage from filesystem and S3 bucket  Fetch nuxt content data from S3 bucket at runtime",{"id":324,"path":325,"dir":282,"title":326,"description":327,"keywords":328,"body":329},"content:20.docus:single_tree.md","/docus/single_tree","Single Tree","Let's have a single tree to organize all files related to content.",[],"  Single Tree  Let's have a single tree to organize all files related to content.  Today we need to   separate  files in many folders:    /content  for files supported by nuxt content (md, json, yaml)   /public  for files not content aware (jpeg, wbep, svg, ...)  some other folders of many file types related to other part of the platform (API, business logic design docs, file samples, ...)  Simplified example of multiple trees:   /\n├── content/\n│   ├── case1.md\n│   └── case2.md\n├── public/\n│   ├── case1/\n│   │   ├── check_step1.webp\n│   │   ├── check_step2.webp\n|   |   ├── sample1.pdf\n│   │   └── photo.webp\n│   └── case2/\n│       ├── check_step1.webp\n│       ├── check_step2.webp\n|       ├── sample2.pdf\n│       └── photo.webp\n└── pp-ref-common/\n    ├── customer1/\n    │   ├── sample1.pdf\n    │   ├── sample2.pdf\n    │   ├── sample3.pdf\n    │   ├── poc.ipynb\n    │   ├── dummy_checklist1.yaml\n    │   ├── dummy_checklist2.yaml\n    │   ├── case1.md\n    │   ├── case1/\n    │   │   ├── check_step1.webp\n    │   │   ├── check_step2.webp\n    │   │   └── photo.webp\n    │   ├── blueprint.penpot.svg\n    │   └── mvp.py\n    └── customer2/\n        ├── sample1.pdf\n        ├── sample2.pdf\n        ├── sample3.pdf\n        ├── poc.ipynb\n        ├── dummy_checklist1.yaml\n        ├── dummy_checklist2.yaml\n        ├── case2.md\n        ├── case2/\n        │   ├── check_step1.webp\n        │   ├── check_step2.webp\n        │   └── photo.webp\n        ├── blueprint.penpot.svg\n        └── mvp.py\n  We can't keep files together.\nWe have to put articles in   content/** \nwhereas images and exotic files must be in   public/** .  We would like to set the Nuxt content source directly to   pp-ref-common/ \nwhere we can easily tell which files are articles/images\nor be ignored.  Maybe a set of rules telling how to traverse such a tree,\nwhat to keep, what to ignore.\nThose rules would be applied on each Nuxt generation.",{"id":331,"path":332,"dir":159,"title":333,"description":334,"keywords":335,"body":336},"content:30.nuxt_studio:0.index.md","/nuxt_studio","Feedback","Here are some pitfalls and wishes from our Nuxt Studio experience.",[],"  Feedback  Here are some pitfalls and wishes from our Nuxt Studio experience.",{"id":338,"path":339,"dir":340,"title":341,"description":342,"keywords":343,"body":344},"content:30.nuxt_studio:escape.md","/nuxt_studio/escape","nuxt_studio","escape key","While editing a file, pressing the escape key move up one level on editor/browser hierarchy.",[],"  escape key  While editing a file, pressing the escape key move up one level on editor/browser hierarchy.  In the editor this beheviour is misleading if you use mutiple cursors.\nThe common way to exit multiple cursors is also pressing the escape key.  To be sure to exit the multiple cursors, I tend to press the escape key even if I'm not in multiple cursor, resulting in exiting the editor.  We may restrict the escape key behaviour to file browser and not in the editor.",{"id":346,"path":347,"dir":340,"title":348,"description":349,"keywords":350,"body":351},"content:30.nuxt_studio:fork_easy.md","/nuxt_studio/fork_easy","Easy fork","On a single click, fork an existing github project and get :",[],"  Easy fork  On a single click, fork an existing github project and get :   a direct link from the README to nuxt studio  a running app via github pages  a new unique set of ID/API_KEY (generated on fork)  a new nuxt studio team  an auto-generated link to join the new nuxt studio team",{"id":353,"path":354,"dir":340,"title":355,"description":356,"keywords":357,"body":358},"content:30.nuxt_studio:git.md","/nuxt_studio/git","git","We may use a simple git repo as Nuxt Studio source backend.",[],"  git  We may use a simple git repo as Nuxt Studio source backend.  Currently Nuxt Studio uses github as its source backend.  We will lose a lot of feature specific to github.  This will open a lot of new usecases where github is not an option :   full open source git forge (gitlab, ...)  lightweight self hosted option (gitea, ...)  sovereign hosting  GAFAM/BATIX free hosting  private hosting for security  edge hosting for speed (huge git repo)  lower price  special free tier feature (gitlab private repo with public pages, ...)",{"id":360,"path":361,"dir":340,"title":362,"description":363,"keywords":364,"body":372},"content:30.nuxt_studio:json_schema.md","/nuxt_studio/json_schema","JSON-schema","Many features related to JSON-schema (some related to docus):",[365,366,367,368,369,370,371],"YAML file linter","front-matter schema","front-matter linter","YAML file visual editing","front matter visual editing","YAML file custom visual editing","front-matter custom visual editing","  JSON-schema  Many features related to JSON-schema (  some related to docus ):  YAML file linter  Use the   redhat YAML vscode extension  while editing YAML file content.\nIt lets you validate your JSON or YAML content against a predefined   schema .  It's a life saver when you deal with strongly typed JSON/YAML content.  With a single first comment pointing to your schema, the editor will check if your content is valid :     # yaml-language-server: $schema=https://paxpar.gitlab.io/schemas/checklist-2.0.schema.json\n   $schema  :   https://paxpar.gitlab.io/schemas/checklist-2.0.schema.json\n   name  :   Ordre d'intervention EDF\n   desc  :   Liste de vérification appliquée lors de la saisie d'un ordre d'intervention\n   tags  :\n     -   atelier\n   owner  :\n     signature_pubkey  :   default\n  The schema URL could also be relative to the current project\nwhere schemas would be stored in   /public/schemas  :     # yaml-language-server: $schema=/schemas/checklist-2.0.schema.json\n   $schema  :   https://paxpar.gitlab.io/schemas/checklist-2.0.schema.json\n   name  :   Ordre d'intervention EDF\n   desc  :   Liste de vérification appliquée lors de la saisie d'un ordre d'intervention\n   tags  :\n     -   atelier\n   owner  :\n     signature_pubkey  :   default\n  front-matter schema  Supporting a   $schema  native property\nin the   front matter \nwill provide a kind of strong typing of document metadata.     ---\n   $schema  :   https://paxpar.tech/schema/mycheck/default/0\n   name  :   Ordre d'intervention EDF\n   desc  :   Liste de vérification appliquée lors de la saisie d'un ordre d'intervention\n   tags  :\n     -   atelier\n   owner  :\n     signature_pubkey  :   default\n   ---\n   \n   # My document\n   \n   Lorem ipsum ...\n  front-matter linter  Replicate the behaviour of the   redhat YAML vscode extension .\nIt lets you validate your JSON or YAML content against a predefined   schema .  Same feature as YAML file linter but restricted to the front-matter.  YAML file visual editing  TODO: describe/show our use of   JSON-editor  front matter visual editing  TODO: describe/show our use of   JSON-editor  YAML file custom visual editing  We may define visual component to edit typed YAML file.\nThe component will be registered to handle a given schema\nand will produce the JSON/YAML payload.  TODO: put an example here from pp  front-matter custom visual editing  We may define visual component to edit typed front matter.\nThe component will be registered to handle a given schema\nand will produce the JSON/YAML payload.  TODO: put an example here from pp  html .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}html.dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .dark .shiki span {color: var(--shiki-dark);background: var(--shiki-dark-bg);font-style: var(--shiki-dark-font-style);font-weight: var(--shiki-dark-font-weight);text-decoration: var(--shiki-dark-text-decoration);}html .default .shiki span {color: var(--shiki-default);background: var(--shiki-default-bg);font-style: var(--shiki-default-font-style);font-weight: var(--shiki-default-font-weight);text-decoration: var(--shiki-default-text-decoration);}",{"id":374,"path":375,"dir":340,"title":376,"description":377,"keywords":378,"body":379},"content:30.nuxt_studio:runtime_use.md","/nuxt_studio/runtime_use","runtime use","Use Nuxt Studio to edit live-content.",[],"  runtime use  Use Nuxt Studio to edit live-content.  Think of a webapp where some pages fetch data from live sources (mostly YAML/JSON§/MD file in a S3 bucket).  Being able to edit those sources with Nuxt Studio without a full or partial site generation (when   hybrid rendering  is not an option).",{"id":381,"path":382,"dir":340,"title":319,"description":383,"keywords":384,"body":385},"content:30.nuxt_studio:s3.md","/nuxt_studio/s3","See also S3 bucket for docus.",[],"  S3 bucket  See also   S3 bucket for docus .  We may use a S3 bucket as Nuxt Studio source backend.  Currently Nuxt Studio uses github as its source backend.  Editing files in Nuxt Studio will result in direct S3 file operations.  s3 is better than git for   live   updates.  git is better than s3 for   traced   updates.",{"id":387,"path":388,"dir":159,"title":389,"description":390,"keywords":391,"body":392},"content:40.nuxt_ui:index.md","/nuxt_ui","Nuxt UI Pro","We are considering moving to nuxt ui pro.",[],"  Nuxt UI Pro  We are considering moving to nuxt ui pro.  As we understand it, nuxt ui pro is a nuxt layer\nthat you add to your project.\nIt provides components and dependencies.  We want to package our own components and dependencies (plus somes pages, layouts and static assets) the same way.  We will make a simple proof-of-concept based\non nuxt ui pro to assess the stack.  Here are the main features :    a shared nuxt layer project   pp-widgets    ✅💀 defined as a nuxt layer  ✅✨ some shared nuxt pages  ✅✨ some shared nuxt layout  ✅✨ some shared nuxt composables  ✅🚨 some shared js/ts libraries  ✅✨ some shared nuxt components  🌀🌀 some shared nuxt components as web components  a starter project to fork   pp-front-starter    ✅✨ some md content files  ✅🚨 the only dep is pp-widgets  ✅🚨 full static generation  ✅✨ hosted on github/gitlab pages  ✅💀 compatible with nuxt studio  dev env with good DX    ✅💀 bun as the package manager  🌀🌀 some vitest unit tests  🌀🌀 some vitest e2e tests with playwright  ✅✨ CI/CD to github/gitlab  ✅✨ CI/CD to K8S  ✅✨ devpod/devcontainer setting  ✅💀 easy switch to use local   pp-widgets   legend :\n✅✨ : already done / easy\n✅💀 : done with errors, not mastered\n✅🚨 : done with some glitch/warning\n🌀🌀 : todo\n  Pending questions :   For a nuxt layer distribution, do I need to put license key in the target repo ?  For a webcomponent distribution, do I need to put license key in the target repo ?  Does the Nuxt UI pro templates provides a pre-configured vitest test set ?  Does the Nuxt UI pro templates provides a sample best-practices component we can use to start new component without any licensing issue ?  Is it possible to embed nuxt ui pro as a web component without any stling issues ?",{"id":394,"path":395,"dir":159,"title":396,"description":397,"keywords":398,"body":399},"content:80.todo.md","/todo","Todo","Log snippet when a YAML file is not valid :",[],"  Log snippet when a YAML file is not valid :     at executor (node_modules/unified/lib/index.js:901:20)\n  at Function.run (node_modules/unified/lib/index.js:884:19)\n  at executor (node_modules/unified/lib/index.js:737:12)\n  at new Promise (\u003Canonymous>)\n  at Function.process (node_modules/unified/lib/index.js:720:47)\n  at parseMarkdown (.nuxt/prerender/chunks/nitro/nitro-prerenderer.mjs:7887:41)\n  at async Object.parse (.nuxt/prerender/chunks/nitro/nitro-prerenderer.mjs:7985:20)\n  at async transformContent (.nuxt/prerender/chunks/nitro/nitro-prerenderer.mjs:8134:18)\n  at async parseContent (.nuxt/prerender/chunks/nitro/nitro-prerenderer.mjs:8610:18)\n  at async .nuxt/prerender/chunks/nitro/nitro-prerenderer.mjs:8580:22\n[error] [nitro] [unhandledRejection] bad indentation of a mapping entry (4:237)\n 1 |  ... \n 2 |  ... \n 3 |  ... \n 4 |  ...  au sein d'une même entreprise :\n-----------------------------------------^\n 5 |  ... \n 6 |  ... \n  \n  1 |  ...\n  2 |  ...\n  3 |  ...\n  4 |  ...  au sein d'une même entreprise :\n  -----------------------------------------^\n  5 |  ...\n  6 |  ...\n  at generateError (node_modules/js-yaml/dist/js-yaml.mjs:1273:10)\n  at throwError (node_modules/js-yaml/dist/js-yaml.mjs:1277:9)\n  at readBlockMapping (node_modules/js-yaml/dist/js-yaml.mjs:2272:7)\n  at composeNode (node_modules/js-yaml/dist/js-yaml.mjs:2531:12)\n  at readBlockSequence (node_modules/js-yaml/dist/js-yaml.mjs:2098:5)\n  at composeNode (node_modules/js-yaml/dist/js-yaml.mjs:2530:12)\n  at readBlockMapping (node_modules/js-yaml/dist/js-yaml.mjs:2254:11)\n  at composeNode (node_modules/js-yaml/dist/js-yaml.mjs:2531:12)\n  at readDocument (node_modules/js-yaml/dist/js-yaml.mjs:2715:3)\n  at loadDocuments (node_modules/js-yaml/dist/js-yaml.mjs:2778:5)\n  at Object.load$1 [as load] (node_modules/js-yaml/dist/js-yaml.mjs:2804:19)\n  Another  log snippet when a YAML file is not valid :   ℹ Vite server warmed up in 8170ms                                                                                     11:35:01 AM\nℹ ✨ optimized dependencies changed. reloading                                                                        11:35:01 AM\nℹ Vite client warmed up in 10346ms                                                                                    11:35:01 AM\n✔ Nitro built in 2447 ms                                                                                        nitro 11:35:02 AM\n🐣📄 custom transformer for checkresult\n🐣📄 custom transformer for PDF\n🐣📄 custom transformer for ignored content\n[nitro] [unhandledRejection] YAMLException: can not read a block mapping entry; a multiline key may not be an implicit key (12:1)\n\n  9 |     - valerie: Puis-je accepter ...\n 10 | \n 11 | Voyons tout d'abord ensemble qu ...\n 12 | \n------^\n    at generateError (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:1273:10)\n    at throwError (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:1277:9)\n    at readBlockMapping (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:2235:9)\n    at composeNode (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:2531:12)\n    at readDocument (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:2715:3)\n    at loadDocuments (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:2778:5)\n    at Object.load$1 [as load] (file:///home/philippe/src/pp-front4/node_modules/js-yaml/dist/js-yaml.mjs:2804:19)\n    at parseFrontMatter (file:///home/philippe/src/pp-front4/node_modules/remark-mdc/dist/index.mjs:37:21)\n    at getNodeData (file:///home/philippe/src/pp-front4/node_modules/remark-mdc/dist/index.mjs:1853:20)\n    at bindNode (file:///home/philippe/src/pp-front4/node_modules/remark-mdc/dist/index.mjs:1838:23) {\n  reason: 'can not read a block mapping entry; a multiline key may not be an implicit key',\n  mark: {\n    name: null,\n    buffer: '\\n' +\n      'animate: true\\n' +\n      'conversation:\\n' +\n      `    - valerie: \"En tant que particulier ou entreprise... Nous recevons de plus en plus de documents dans un format dématérial\nisé via notre boite e-mail personnelle, pro, et également d'un service à un autre au sein d'une même entreprise :\"\\n` +\n      '    - valerie: Peut-on avoir confiance en ces documents ?\\n' +\n      '    - valerie: Recevoir ces documents dématérialisés est-il un gage de fiabilité comparativement à un document en version pap\nier ?\\n' +\n      '    - valerie: Nous allons voir 3 cas concrets de factures.\\n' +\n      '    - valerie: Puis-je avoir confiance en 2 de ces factures et les régler en toute confiance ?\\n' +\n      '    - valerie: Puis-je accepter, sans me méfier, une facture EDF comme justificatif de domicile ?\\n' +\n      '\\n' +\n      \"Voyons tout d'abord ensemble quels sont les risques auxquels je m'expose.\\n\",\n    position: 786,\n    line: 11,\n    column: 0,\n    snippet: '  9 |     - valerie: Puis-je accepter ...\\n' +\n      ' 10 | \\n' +\n      \" 11 | Voyons tout d'abord ensemble qu ...\\n\" +\n      ' 12 | \\n' +\n      '------^'\n  }\n}\n",1701178752621]